export const SKILL_DESCRIPTIONS: Record<string, string> = {
  "Анимагия": `Анимагия – способность волшебника по своему желанию превращаться в определенное животное, близкое ему в характере и внешних особенностях.

Вид животного, в которое способен превращаться анимаг, называется анимагической формой. У каждого анимага может быть только одна анимагическая форма. Обычно характер анимага совпадает с характером животного, в которого анимаг способен превращаться.

Обычно в животном отражаются отличительные признаки или увечья человеческого тела. Например, какие-то украшения, которые человек носит постоянно, кольца или кулоны, браслеты и иногда даже серьги - они оставляют след в виде темных характерных пятен на шерсти. То же самое и с очками.

Пребывающий в животной форме по большей части сохраняет способности к человеческому мышлению, осознание своего Я и свои воспоминания.

Анимаг имеет большое преимущество в сфере шпионажа и преступности. По таковой причине существует Реестр Анимагов, в котором все анимаги должны указать свои личные данные и точное описание внешнего вида своего животного облика. Отказ от внесения своих данных в Реестр может привести к заключению в Азкабан и штрафам.`,

  "Телесный патронус": `Патронус — магическая сущность, вызываемая заклинанием «Экспекто патронум». Служит как защита от Дементоров и Смеркутов. Может быть выражена как просто облако серебристого пара, так и обретать различные формы (так называемый «телесный Патронус»).

«Телесные Патронусы» принимают обычно вид какого-либо животного, соответствующего характеру вызвавшего его волшебника. Для вызова Патронуса нужно вспомнить самые счастливые моменты своей жизни, иначе кроме вспышки света ничего не получится.

Известны примеры, когда форма Патронуса изменяется в результате тяжелой утраты, когда человек влюбляется или если, произошли глубокие изменения в характере личности. Некоторые волшебницы и волшебники вообще не могут произвести Патронус до тех пор, пока они не переживут какой-нибудь психологический шок.

Помимо защиты от дементоров, Патронус может осуществлять и другие функции: передавать короткие голосовые сообщения (при этом звучит голос волшебника, пославшего патронус) и в критический и опасный для жизни момент может активизироваться (происходит крайне редко, известно только два случая).`,

  "Трансгрессия": `Трансгрессия – это способ перемещения волшебника на достаточно дальнее расстояние за считанные секунды. Однако для трансгрессии существуют ограничения по дальности перемещения. Перемещение без ограничений возможно только с порталом.

Существует ещё так называемая «парная трансгрессия», когда один волшебник (или другое существо, способное к трансгрессии) переносит не только себя, но и другого человека (в редких случаях — несколько человек).

Правило трёх Н: нацеленность, настойчивость и неспешность. Для того, чтобы преодолеть дальнее расстояние за считанные секунды, вам надо чётко представить место прибытия, сконцентрироваться на желании туда попасть и без суеты, спокойно крутануться на месте, мысленно нащупывая путь в ничто и переносясь в запланированную точку.

С помощью трансгрессии невозможно переместиться на другой континент или преодолеть расстояние, равное площади нескольких стран. Помимо этого, есть и другие ограничения, например при попытке трансгрессировать сквозь специальные магические границы, человек просто не тронется с места.`,

  "Магия пространства": `Как понятно из названия, маги-пространственники, черпают силу из окружения, как правило, опираются в своей работе на различные особенности местности и влияют на пространство. Пространственники часто тянут силу напрямую из меридиан – потоков энергии, пронизывающих весь мир. Они способны играть с тканью мира, придавая ей нужную им форму, быстро перемещаться на местности, следуя за меридианом, оперировать левитацией, провешивать временные и постоянные порталы. Считается, что способность к этому виду магии не передается по наследству, она сцеплена с душой, но даже в качестве сопутствующего дара это направление встречается крайне редко и проявляет себя ограниченно.

Отличие постоянно действующих порталов от обычных заключается не только в сроке их использования. Простые порталы, которые можно получить только в Министерстве магии, активируются либо по установленному на них времени, либо при помощи заклинания “Портус”, позволяющему переместиться в чётко заданные координаты туда и обратно при необходимости. Порталы, установленные магами-пространственниками, действуют на постоянной основе, работая по принципу тоннеля, связывающего между собой города, страны или континенты. Как правило, выглядят они как замаскированный проход в стене и действуют по принципу магического коридора, войти в который можно через точку А и беспрепятственно выйти в точке Б.`,

  "Мортимагия": `Мортимагия – способность мага превращаться в предметы и явления природы. Волшебник, который обладает ею, называется мортимагом. Умение превращаться в предметы не является врожденным, а развивается по мере занятий, направленных на изучение этого вида магии. Этот раздел очень похож на анимагию и метаморфизм. Их отличие в том, что превращение в неживой объект происходит быстрее, но и является более сложным, чем вышеупомянутые. Обладатель этой способности может превращаться в абсолютно любой предмет: в тряпку, в цветок, в камень.

Мортимагия выделяется из полиморфизма тем же, чем анимагия выделяется из аниморфизма. Выражается это в том, что мортимаг, продолжает мыслить, как человек, превратившись в объект природы. Он осознает все, что с ним происходит и, более того, понимает, каким образом он стал неживым предметом и как сможет опять стать человеком. Существо же, превращенное из неживого объекта или неживой объект, созданный из живого существа, забывает все, что с ним было раньше и живет настоящим моментом.

Предмет природы, в который способен превращаться мортимаг, может быть абсолютно любым (исключения прописаны в законе трансфигурации Ф. Гампа). Одежда мортимага теряется во время превращения, и восстанавливается после его обратной трансфигурации в человеческое тело.

Оптимальное время нахождения в обличии неживого предмета варьируется от нескольких часов до нескольких дней.`,

  "Невербальная магия": `Невербальная магия — совокупное название заклинаний, формулы которых не произносятся вслух колдующим. Подразделяются на те, что изначально задуманы невербальными (прим. Левикорпус), и те, что становятся невербальными по личному желанию мага.

Основная сложность в освоении невербальной магии заключается в силе привычки и повышенной концентрации: произнесённая вслух формула помогает магу сосредоточиться, создаёт дополнительную опору мыслеобразу. Учитывая, что именно такой способ мы практикуем с детства, остаться без одного из столпов успешного исполнения заклинания может быть непросто. Невербальная магия наиболее полезна в бою, так как дает преимущество по времени: без полной уверенности в том, какое заклинание вы сотворили, противнику будет трудно, а иногда и невозможно сходу идентифицировать его по лучу. Таким образом шанс отразить его существенно уменьшается.`,

  "Беспалочковая магия": `Беспалочковая магия — способ концентрации магической энергии без использования артефактов (волшебной палочки, посоха). С помощью силы воли маг формирует в пространстве сгусток энергии и отправляет его в цель, что и равносильно лучу заклинания, выпущенному из волшебной палочки. При создании изначального сгустка расходуется собственная магическая энергия волшебника, в полёте же он усиливается за счёт соударения со свободной энергией, благодаря чему достигает нужной силы.

Традиционно при беспалочковом колдовстве волшебники концентрируют магическую энергию вокруг рук. Однако, это лишь дело привычки и вкуса: например, восточные маги в бою пользуются и обеими ногами, используя их в качестве "платформы" для атакующих заклинаний, тогда как свободную руку оставляют для "щита". В повседневном применении используются пальцы, кисти и предплечья.

Существует еще один редкий подвид беспалочковой магии, механизм которого значительно отличается от привычного и еще более труден в освоении. Бывают обстоятельства, при которых любые движения тела ограничены. Например, вас связали или вас в укрытии может выдать малейшие колебания. В этом случае толкать сгусток энергии в сторону цели нечем. В этом случае у волшебника есть два пути: можно сконцентрировать магию и усилием воли переместить её в нужном направлении (контроль взглядом) или создать импульс непосредственно у цели.

Создание импульса непосредственно у цели позволяет сократить время концентрации на сгустке энергии, однако, в связи с этим исключает использование мощных заклинаний. Практическое освоение требует некоторых усилий, но по сложности в целом сопоставимо со сгущением энергии вокруг части собственного тела.`,

  "Легилименция": `Искусство легилименции чрезвычайно сложное, оно требует множества интеллектуальных и психологических затрат. Не все из вас смогут овладеть этим искусством. Только наиболее усидчивые и внимательные.

Легиллименция - это умение извлекать чувства и воспоминания из чужого ума. Маленькая оговорка, это не имеет ничего общего с представлениями маглов о чтении мыслей. Ум - не книга, которую можно раскрыть, когда тебе заблагорассудится. Мысли не напечатаны внутри черепа. Мозг - это сложный и многослойный орган. Уметь пользоваться легилименцией - это значит быть способным при определенных условиях проникать в чужое сознание и правильно интерпретировать добытые сведения. Овладение техникой легилименции позволит вам наверняка отличать правду от лжи, воспринимать чужие воспоминания и ощущения.

Для удачного опыта легилименции необходим зрительный контакт, но это не всегда является решающим контактом. Важно иметь с объектом какую-либо связь. Однако именно зрительный контакт делает вашу жертву наиболее уязвимой в момент опыта по легиллименции. Еще одной важной для легилименции основой служит повышение эмоционального уровня подопытного. Если он зол или напуган, намного проще проникнуть в его сознание. Если он спит, то будет так же проще проникнуть в сознание подопытного.

Невербальная Легилименция - область темногомагического знания, направленная на проникновение в чужое сознание в целях извлечения нужной информации. Одна из наиболее редких и сложнейших наук, относится к разделу невербальной магии. Невербальная легилименция - сплав силы воли и магической концентрации, направленной на взлом сознания и извлечения из него информации.`,

  "Окклюменция": `Окклюменция - это проявление воли, а также навыков самоконтроля и самодисциплины. Это не волшебство, а психический фактор. Кто-то способен лучше противостоять гипнозу, кто-то отлично внушаем. В случае окклюменции речь идет о способности и активном навыке контролировать деятельность собственного разума, мыслей и подсознания.

Так или иначе, помимо легилименции есть иные способы заставить окклюмента рассказать то, что ему хотелось бы скрыть. Речь идет о маггловских пытках, комбинирующих психофизические способы воздействия на личность. Всё, что ослабляет психику, ослабляет способность контролировать сознание и тем более осознанно подменять истинные воспоминания и мысли ложными.

Для того, чтобы противостоять наложенному заклятию вам необходимо максимально сосредоточиться, при этом отбросить эмоции, очистить сознание. Тренируйтесь очищать сознание. Не допускайте противника в свое сознание, примените свою волю. Учитесь контролировать свои эмоции, через эмоции вы становитесь уязвимым. Не придавайте чувствам и воспоминаниям решающего значения. Это делает вас легкой добычей для того, кто обладает искусством легилименции. Заграждение разума - это борьба, постоянная борьба, но постоянные тренировки помогут вам противостоять чужому проникновению.

Все конечно же зависит от силы воли волшебника, умения концентрироваться и знания теории, а так же количества опыта вырабатываемого в практике.`,

  "Самостоятельная левитация": `Самостоятельная левитация – это продвинутая форма магической левитации, позволяющая волшебнику осуществлять полет без использования вспомогательных средств (метел, ковров-самолетов и прочих артефактов). Данный навык требует высокого уровня владения трансфигурацией и чарами левитации.

Основные принципы:

Антигравитационное поле создается путем трансфигурации гравитационных свойств тела волшебника. Маг должен научиться перенаправлять гравитационные потоки, формируя вокруг себя защитное поле, которое противодействует силе притяжения. Энергетический контур формируется за счет концентрации магической энергии в нижней части тела. Это создает необходимую подъемную силу и позволяет контролировать высоту полета.

Векторный контроль осуществляется через мысленное управление потоками энергии. Маг должен научиться направлять движение вверх, вниз, вперед и назад, используя мысленные команды и визуализацию траектории полета.Стабилизационная система включает в себя создание энергетических щитов вокруг тела для защиты от турбулентности и внешних воздействий. Эти щиты также помогают поддерживать равновесие в воздухе.`,

  "Артефакторика": `Артефакторика – магическая наука, искусство создавать предметы с волшебными свойствами и наделять таковыми уже готовые. Не путать с Артефактологией.

Артефактология – магическая наука, изучающая волшебные предметы, их свойства, воздействие на человека и окружающую среду. Является исключительно теоретическим разделом. Невозможно стать грамотным артефактором, не овладев основами артефактологии.

Артефакторы используют заклинания для добавления предмету новых, не имеющихся в нём ранее, магических свойств. Важно помнить – артефактом может быть только неживой объект. По-настоящему умелые артефакторы ценятся в магическом мире достаточно высоко.

Базовые определения:

ᅠᅠЯдро артефакта – «сердце» предмета, основной объект в работе артефактора. С его помощью артефактор придаёт предмету новые, не имеющиеся в нём ранее, магические свойства.

Пример: если просто наложить заклинание левитации на книгу, она взлетит на то время, что заклинание будет поддерживаться заклинателем. Если артефактор вложит чары левитации в само ядро книги, определив левитацию как её новое свойство, книга будет летать постоянно или действовать в соответствии с той моделью поведения, что задаст артефактор.

Важно: артефактом может быть только неживой объект. Модель поведения артефакта задаётся тем, кто открывает ядро объекта, однако сами новые свойства может помочь вложить более талантливый в необходимой области коллега. Самые мощные артефакты всегда создаются сообща.

ᅠᅠАура артефакта – энергетическая структурная облочка, напитанная магией артефактора(ов). Изучается с помощью диагностических чар. В зависимости от наличия защиты и способностей диагноста-артефактора, позволяет собрать информацию о предмете разной степени полезности.

Например: мощность артефакта, его назначение, в некоторых случаях даже владелец и/или создатель.

ᅠᅠПечать – одноразовые артефакты. В отличие от сложных артефактов, которым можно установить модель поведения или сложный алгоритм действий, печати выполняют конкретное действие в ответ на их активацию.

Пример: для печатей часто используют пластинку слюды или объект, который можно легко сломать или открыть (но который не сделает это самостоятельно по случайности), и указывают, что активацией послужит слом или открытие. Часто, чтобы обезопасить мага от случайного применения разрушительного заклинания, на слом накладывают также слово-ключ как активатор.

ᅠᅠАмулет – предмет, наделённый магическими свойствами более высокого уровня, чем печать. Чаще всего используются в целях защиты, однако назначение может варьироваться. Многоразовые, однако энергетическая ёмкость небольшая. После её исчерпания необходимо зарядить изделие, чтобы пользоваться снова.`
};
